(* Рефлексия. 
В задачке 40.2.1 даже подумывал на предусловие с разворотом списка и проверкой данного элемента на тот факт, что если он меньше, то можно сразу заканчивать, но все же посчитал такую оптимизацию излишней.
По задаче 40.2.5 боюсь не совсем понял уточнение "(элементы, одинаковые по значению, считаются разными)". Интерпретировал как "если в первом списке повторяющиеся элементы, а во втором их количество меньше, то убираю не более этого количества".
А вообще, дольше всего зависал над sort - тут честно говоря какой-то монстр получился. Честно говоря, чувствую что сильно плаваю пока в вопросе - не получается сделать компактный красивый код (но очень хочется).
По задачам предыдущего занятия:
Как говорится "предчувствия его не обманули". Если для первых трех функций реализация аналогичная (кроме лишнего сравнения в pattern matching), то вот по 39.4 не сообразил, что половину решения написал в rmodd и достаточно добавить такую же функцию для четных и их уже парой заиспользовать...
*)