(* Рефлексия. 
собственно особых проблем вроде не возникло (ну с процентами вообще), разве что немного затупил с формулировкой третьей задачи, но вроде понял правильно.
По задачам предыдущего занятия:
17.4.1. решение верное, разве что поставил меньше сторожевых условий
17.4.2. Аналог второго решения. Но очень понравился однострочник из первого варианта этой функции.
17.4.3. В принципе допустимое решение, разве что по сравнению с эталонным постоянно за собой везде таскаю строку. Ну и первый раз увидел синтаксис с внутренней функцией - запомню.
*)