(* Рефлексия. 
Вот все никак не получается избавиться от внутренних функций. Но здесь конечно и без этого очень долго провозился, даже сначала пришлось сделать привычный вариант в питоне с циклами, чтобы хоть как-то за алгоритм зацепиться. Ну и итоговый вариант тоже сначала со списками сделал, потом уже под множества переписал (ну заменил действия со списком на фукнции множеств)
По задачам предыдущего занятия:
Вот кстати в 41.4.1 не стал делать внутреннюю функцию :)
по 41.4.2 тут я что-то перемудрил с условиями внутри функции для fold. Тут я вдимо немного не понял как же fold работает
по 41.4.3 решение верное, единственно я опять не использовал List.rev т.к. думал что все rev в задании надо реализовать через fold
*)