(* Рефлексия. 
С деньгами сложение сделал "в лоб", а вычитание, чтобы не заморачиваться с отдельными переводами, перевел все в медь, вычел и уже потом стандартно "раскидал по корзинкам". Приведение к формату наверное можно было бы реализовать отдельной функцией, но оставил как есть.
По операциям с комплексными числами вроде бы ничего не напутал - собственно все решение присутсвует в описании задачи.
По задачам предыдущего занятия:
Решения аналогичны эталонным, только в curry не ставил скобки.
*)