(* Рефлексия. 
Здесь главный вопрос был насколько глубокая предполагалась самостоятельность в реализации, т.е. какие методы каких типов можно использовать, а какие еще нет (ибо не слишком самостоятельная такая реализация получается). Решил остановиться на списках. Так то можно было наверное и раньше с Map.contains, например сделать. А может предполагалось конечно и более глубокое погружение, нежели использование List
По задачам предыдущего занятия:
Честно говоря отнюдь не сразу понял реализацию в ответе - некоторое время распутывал. Но и моя вроде бы рабочая.
*)