(* Рефлексия. 
По задачам надеюсь правильно реализовывал с помощью конструкций типа head :: (head2 :: tail). Есть некоторое сомнение по 39.4 - там кажется уж слишком наворочепнное решение получилось. Но работает, упростить не получилось.
По задачам предыдущего занятия:
С интересом ознакомился с эталонными решениями. У меня конечно сделано гораздо "развесистей", но есть небольшое оправдание - оператор @, который использован в решении дан только в следующем уроке :) А так как начинал я с upto и там оператор :: не прошел, то и оставшиеся функции я делал через него. Но по смыслу решения в общем аналогичные.
*)