(* Рефлексия. 
Реализованный в прошлом задании вариант не оперировал строками "АМ" и "РМ", а полагался на то, что строка "РМ" больше "АМ" и сравнивал просто поля f. В новом подходе с размеченным объединением все сохраняется - РМ также больше АМ, т.к. в объявлении следует после. Так что данная функция не нуждается в изменении (на всякий случай протестировал). Поэтому изменял предложенный в решении вариант - тут, насколько я понял, достаточно поменять строку на значение.
По задачам предыдущего занятия:
Тут, как уже написал выше, использовал другой алгоритм, полагаясь на порядок сравнения полей (после первоначального сравнения f, т.к. сначала надо было сравнить AM-PM).
*)